<h1 style="font-size: 2.0em;">Mengeluarkan kolom dari Data Frame</h1>

<h1 style="font-size: 1.6em;">Import Modules</h1>

In [6]:
import pandas as pd
print(pd.__version__)

2.2.2

<h1 style="font-size: 1.6em;">Persiapan Data Frame</h1>

In [8]:
data = {'nama':['bayu','indra','devi','agni'],
       'jenis_kelamin':['L','L','P','L'],
       'usia': [23,21,22,25]}
df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

<h1 style="font-size: 1.6em;">Mengeluarkan kolom dari Data Frame</h1>

In [10]:
usia = df.pop('usia').to_frame()

In [12]:
df

    nama jenis_kelamin
0   bayu             L
1  indra             L
2   devi             P
3   agni             L

In [14]:
usia

   usia
0    23
1    21
2    22
3    25